{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-DURATION",
    "1": "B-EMPLOYER",
    "2": "B-INCOME",
    "3": "B-LOAN_AMOUNT",
    "4": "B-PURPOSE",
    "5": "I-DURATION",
    "6": "I-EMPLOYER",
    "7": "I-PURPOSE",
    "8": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DURATION": 0,
    "B-EMPLOYER": 1,
    "B-INCOME": 2,
    "B-LOAN_AMOUNT": 3,
    "B-PURPOSE": 4,
    "I-DURATION": 5,
    "I-EMPLOYER": 6,
    "I-PURPOSE": 7,
    "O": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "use_cache": false,
  "vocab_size": 30522
}
